WHeiu/Drone-control-project/无人机管控模块/程序/stm32_new_HAL_LL/Stm32_New-1.1.5/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32l4xx_hal.h"

/* USER CODE BEGIN Includes */
#include<math.h>
#include <stdio.h>
#include <stdint.h>
#include <string.h>
#include "bmp280.h"
#include "mp9250.h"
#include "EC20.h"
#include <math.h>
#include "usart.h"
#include "mpu_DMP.h"
#include "outputdata.h"
#include "mmpu9250.h"
#include "mpuu.h"
#include "invmpuu.h"
#include "invmpudmpmotiondriver.h" 
#include "user.h"
#include "adc.h"
#include "MahonyAHRS.h"
#include "MPU9250_F.h"
#include "MPP9250.h"
#include "mpuu9250.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
//ADC_HandleTypeDef hadc1;
//DMA_HandleTypeDef hdma_adc1;

CRC_HandleTypeDef hcrc;

QSPI_HandleTypeDef hqspi;

RTC_HandleTypeDef hrtc;

SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi2;

UART_HandleTypeDef huart4;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;
DMA_HandleTypeDef hdma_uart4_rx;

HCD_HandleTypeDef hhcd_USB_OTG_FS;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

//void uartdamget(void);
 long quatt[4];
 extern uint8_t response[3];

#define BUFFERSIZE 300      
#define RXLEN 200
#define COUNTOF(__BUFFER__)   (sizeof(__BUFFER__) / sizeof(*(__BUFFER__)))
char ReceiveBuff[RXLEN];
char UART4_ReceiveBuff[RXLEN];
char AT_QIOPEN[100]={0};
char IP_Default[100]={"AT+QIOPEN=1,0,\042TCP\042,\042132.232.49.195\042,5159,0,2\r\n"};
char data[10];
short accel[3],gyro[3],mag[3];

uint16_t AD_Value = 0;
float Vbat = 0;
char VBAT[10]={0};

//uint8_t GPS_DATA_RECEIVE[RXLEN]="Connect the device\r\n";; 
uint8_t recv_end_flag = 0,Rx_len;       

__IO ITStatus UartReady = RESET;

#define RTC_ASYNCH_PREDIV    0x7F
#define RTC_SYNCH_PREDIV     0xF9
#define SENSORS_STATE_OK     0x01
#define CONNECT_STATE_OK     0x02

#define EC20_engine          0x00 //EC20 engine
#define TEST_SEND            0x00
#define ERROR_STA            0X01
#define SUCCFULL_STA         0X00

int Uart_count=0;
struct {
			int32_t v_actual_temp_s32;
			int32_t v_actual_press_u32;
			int32_t v_actual_temp_combined_s32;
			int32_t v_actual_press_combined_u32;
			uint32_t actual_press_u64;
			float v_actual_temp_float;
			float v_actual_press_float;
			double v_actual_temp_double;
			double v_actual_press_double;
			int32_t err_cnt;
} bmp_data;

char str[100];

/**
  * @brief  Set the communication protocol on GPRS.
  *
  * @note   Tracker report:AAA, 140,latitude, longitude, altitude, Speed ,roll, pitch, yaw, 
						time_boot_ms, voltage_battery, battery_remaining, type, system_status
  *
  * @param  Longitude/Lantitude: Unit: degree ,Decimal. For example: -23.256438 .
																 When a minus (-) exists, the tracker is in the southern hemisphere.
																 When no minus (-) exists, the tracker is in the northern hemisphere.
	* @param	Altitude: Unit: meter.
  * @param 	Speed: 		External Gps provides speed data.
  * @param  Battery_status:   Battery_status <0, low battery; 
															Battery_status >0, normal status.
  * @param 	Uav_type: save the UAV of information.	
	*	@param  Vendor:	Manufacture name: HWA type defined "HW"
	* @param  System_status:Device status :    bit 0 = 1:sensors ok!;			bit 1 = 1:comunication to flying control system ok!
																						 bit 2 = 1:???        ;			bit 3 = 1:???
																						 bit 4 = 1:???        ;		  bit 5 = 1:???
																						 bit 6 = 1:???        ;			bit 7 = 1:???
  * @retval None
  */
	
typedef struct  
{  
    float 		Longitude;  
    float 		Lantitude; 
		int 			Altitude;
	  float		  Speed_x;
		float		  Speed_y;
		float		  Speed_z;
		float			Roll_angle;
		float 		Pitch_angle;
		float 		Yaw_angle;
		uint32_t  Timestamp;
		int8_t 		Battery_status;
		int8_t 		*Uav_type;
		char 			Vendor[3];
		uint8_t 	System_status; 
} Uavcomunication; 

/***********extern***************/
extern MPU_value mpu_value; 
extern char EC20_rx_buff[512];

extern char *EC20_sendmsg_cmd;
extern char *EC20_init_cmd;

/* USER CODE END PV */

