WHeiu/Drone-control-project/无人机管控模块/程序/stm32_new_HAL_LL/Stm32_New-1.1.5/Src/main.c
/* Private function prototypes -----------------------------------------------*/
static void LL_Init(void);
void SystemClock_Config(void);
static void MX_NVIC_Init(void);

void SystemClock_Config(void);
static void MX_GPIO_Init(void);      
static void MX_CRC_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_SPI1_Init(void);
static void MX_SPI2_Init(void);       
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
//static void MX_ADC1_Init(void);
static void MX_RTC_Init(void);
static void MX_USB_OTG_FS_HCD_Init(void);
/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
extern int8_t BMP280_Begin(void);
extern float BMP280_ReadTemperature(void);
extern float BMP280_ReadPressure(void);
extern uint32_t BMP280_ReadPressure_int64(void);
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
char TEST_BUF[20];
int Receive_Count=0;
int UART4_Receive_Count=0;
float Magx = 0,Magy = 0,Magz = 0;

char Pf[20];
char Tf[20];
char MMHG[20];
char HIGH[20];
float altitude1; //存放初始高度

char Pitch_[100];
char Roll_[100];
char Yaw_[100];
float pitch,roll,yaw; 	        		//欧拉角
 
extern uint8_t InitOffset; 
 
char V_Vlaue[20];
//printf重定向串口3
int fputc(int ch, FILE *f)
{
	uint8_t c=(uint8_t) (ch & 0x00FF);
  HAL_UART_Transmit(&huart3,&c,1,10);
  
  return ch;
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
  //int i=0;
	 LL_Init();
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();
  /* USER CODE BEGIN Init */
 
	uint32_t Uart_count=0;  //Uart_count is used to test uart 
	
	uint8_t Flag_test=SUCCFULL_STA;    //set one
	uint8_t Flag_run =SUCCFULL_STA-1;  //set zero
	
	//uint32_t ADC_Value[50];
	uint32_t ad1;
	//uint8_t  ADC_i;
	
	uint8_t tempdata[50]={0};
	uint8_t test_count=0;
	uint8_t test_flag=1;
	uint8_t count_ex=100;
	uint8_t count_OK=0;
	uint8_t *pTempdate;
	uint8_t m=0;
	uint8_t test_counter_polling=0;

	float value=1.234;
	uint8_t t=0;	            		//默认开启上报
	
	short aacx,aacy,aacz;	        		//加速度传感器原始数据
	short gyrox,gyroy,gyroz;        		//陀螺仪原始数据 
	short temp;		                		//温度 
	char buf[100];
	uint8_t tbuf[18]; 
	
  char TEST1[20] = {0};
	char TEST2[20] = {0};
	char TEST3[20] = {0};
	char TEST4[20] = {0};
	char TEST5[20] = {0};
	char TEST6[20] = {0};
	char TEST7[20] = {0};
	char TEST8[20] = {0};
	char TEST9[20] = {0};	
	char TEST10[20] = {0};
	char TEST11[20] = {0};
	char TEST12[20] = {0};
	int i=0;
	char *strx;
	pTempdate=tempdata;
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
	MX_GPIO_Init();       
  MX_CRC_Init();
//	MX_RTC_Init();
// MX_DMA_Init();
//MX_UART4_Init();         
  MX_USART1_UART_Init();
  MX_USART2_UART_Init();
 // MX_USART3_UART_Init();         
  MX_QUADSPI_Init();

  MX_SPI1_Init();
  MX_SPI2_Init();
  MX_ADC1_Init();

//  MX_USB_OTG_FS_HCD_Init();

  /* Initialize interrupts */
 // MX_NVIC_Init();                 
  /* USER CODE BEGIN 2 */
	
//  MX_GPIO_Init();
 
  MX_USART3_UART_Init();
  MX_UART4_Init();
  MX_NVIC_Init();
  user_usartInit();   //开串口中断
  
	//使能CPU的L1-Cache

 
	

	/*************init the BMP280****************/
  if (BMP280_Begin() == -1)
  bmp_data.err_cnt++;
	printff(USART3, "Finshed the inition of BMP280.  \r\n",strlen("Finshed the inition of BMP280.  \r\n"));	  
	
	/*************init the MPU9250****************/
 //Init_MPU9250();
	MMPU9250_Init();
		sprintf( TEST10, "%u", response[0]); 
  	sprintf( TEST11, "%u", response[1]); 
	  sprintf( TEST12, "%u", response[2]); 
	  printff(USART3, "response:\r\n",strlen("response:\r\n"));
		printff(USART3, TEST10,strlen(TEST10));   printff(USART3, "\t",strlen("\t"));
		printff(USART3, TEST11,strlen(TEST11));   printff(USART3, "\t",strlen("\t"));
		printff(USART3, TEST12,strlen(TEST12));   printff(USART3, "\t",strlen("\t"));
	  printff(USART3, "\r\n",strlen("\r\n"));
	Mahony_Init(125);
	printff(USART3, "Finshed the inition of MPU9250.  \r\n",strlen("Finshed the inition of MPU9250.  \r\n"));	 		
//  while(MPU9250_Init());             			//初始化MPU9250
//	while(mpu_dmp_init())         
//	{   
//		printff(USART3, "MPU9250_Init Error!!!\r\n",strlen("MPU9250_Init Error!!!\r\n"));	   
//	}
//	printff(USART3, "Finshed the inition of MPU9250.  \r\n",strlen("Finshed the inition of MPU9250.  \r\n"));	 		

//	HAL_GPIO_WritePin(GPIOA,GPIO_PIN_10,GPIO_PIN_SET);//TURN ON LED_RED 
//	
	
	
//	/*************init the EC20****************/	
	EC20_Init();   //开启EC20    EC20初始化 ,先拉高在拉低
	for(i = 0; IP_Default[i] != '\0' ; i++)  //初始化默认服务器IP地址和端口
	    AT_QIOPEN[i] = IP_Default[i];
	printff(USART3, AT_QIOPEN,strlen(AT_QIOPEN));	
//  EC20_GPS_Init();  //向服务器上报GPS  EC20初始化
	EC20Send_ChangeMode(1);  //命令模式 不能省略，否则可能导致下次烧录程序进入透传模式从而无法正确执行程序
	EC20_TR_Init();    //服务器下发EC20初始化  
	printff(USART3, "Finished the inition of EC20.  \r\n",strlen("Finished the inition of EC20.  \r\n"));	

	bmp_data.v_actual_press_float = BMP280_ReadPressure();    //读取初始气压高度
	altitude1 = (1013.25-(bmp_data.v_actual_press_float/100))*9;    //通过气压换算高度 , 参考高度点
		
 //	Get_IMEI();
	UART4_CLR_RecvBuf();
	printff(USART3, "Program is running! \r\n",strlen("Program is running! \r\n"));
  /* USER CODE END 2 */
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
 //		HAL_GPIO_TogglePin(GPIOB,GPIO_PIN_2);
		 
#if 0 //adc采样，采样电池
		printff(USART3, "-------------------------------\r\n\r\n", strlen("-------------------------------\r\n\r\n"));
		printff(USART3, "V_Vlaue\r\n",strlen("V_Vlaue\r\n"));
		LL_mDelay(500);
		for(ADC_i = 0,ad1 =0; ADC_i< 100;)
		{
				ad1 += ADC_Value[ADC_i++];
		}
		ad1 /= 50;
//		printff(USART3, "\r\n******** ADC DMA Example ********\r\n\r\n", strlen("\r\n******** ADC DMA Example ********\r\n\r\n"));
//	printf(" AD1 value = %1.3fV \r\n", ad1*3.3f/4096);
		sprintf( V_Vlaue, "%f", ((ad1*3.3f)/4096 )); 
		printff(USART3, V_Vlaue,strlen(V_Vlaue));
		printff(USART3, "\r\n\r\n",strlen("\r\n\r\n"));
		
