WHeiu/Drone-control-project/无人机管控模块/程序/stm32_new_HAL_LL/Stm32_New-1.1.5/Src/main.c
		printff(USART3, "-------------------------------\r\n\r\n", strlen("-------------------------------\r\n\r\n"));  


#endif
#if 0
 printff(UART4, "ATI\r\n",strlen("ATI\r\n"));
 printff(USART3, "ATI\r\n",strlen("ATI\r\n"));
 delay_ms(3000);
 printff(USART3,UART4_ReceiveBuff,strlen(UART4_ReceiveBuff));
 UART4_CLR_RecvBuf();
#endif
   
#if 1
//	 	printff(USART3, "TEST!!!\r\n",strlen("TEST!!!\r\n"));
//		READ_MPU9250_MAG();
//		READ_MPU9250_ACCEL();
//		READ_MPU9250_GYRO();

//		printff(USART3, "Waiting for instruction!!!\r\n",strlen("Waiting for instruction!!!\r\n"));

		
//		printf("Mag: x:%d \ty:%d\tz:%d   \n", mpu_value.Mag[0],mpu_value.Mag[1],mpu_value.Mag[2]);
//		printf("Gyro: x:%d \ty:%d\tz:%d   \n", mpu_value.Gyro[0],mpu_value.Gyro[1],mpu_value.Gyro[2]);
//		printf("Accel: x:%d \ty:%d\tz:%d   \n", mpu_value.Accel[0],mpu_value.Accel[1],mpu_value.Accel[2]);
//	 
//      EC20_GetGps_Send();    //EC20获取GPS信息并发送给服务器 ，要先初始化EC20_GPS_Init();
   

      USART3_Ack_Interaction();   //实现串口交互，显示维护信息及配置相关参数
      EC20Send_RecAccessMode();   //透传模式下接收服务器下发的命令
		  printff(USART3, "Waiting for instruction!!!\r\n",strlen("Waiting for instruction!!!\r\n"));
		  LL_mDelay(500);
#endif
//    printff(USART3, "-----------------------------------\r\n", strlen("-----------------------------------\r\n"));
//	  printff(USART3,"**************MPU9250**************\r\n",strlen("**************MPU9250**************\r\n"));
//    MPU9250_Get9AxisRawData(accel,gyro,mag);
//    Sensor_Read();
//		sprintf( TEST1, "%d", accel[0]); 
//		sprintf( TEST2, "%d", accel[1]); 
//		sprintf( TEST3, "%d", accel[2]); 
//		sprintf( TEST4, "%d", gyro[0]); 
//		sprintf( TEST5, "%d", gyro[1]); 
//		sprintf( TEST6, "%d", gyro[2]); 
//		sprintf( TEST7, "%d", mag[0]); 
//		sprintf( TEST8, "%d", mag[1]); 
//		sprintf( TEST9, "%d", mag[2]); 
//	  printff(USART3, "\r\nACC:\r\n",strlen("\r\nACC:\r\n"));
//		printff(USART3, TEST1,strlen(TEST1));   printff(USART3, "\t",strlen("\t"));
//		printff(USART3, TEST2,strlen(TEST2));   printff(USART3, "\t",strlen("\t"));
//		printff(USART3, TEST3,strlen(TEST3));   
//  	printff(USART3, "\r\nGYO:\r\n",strlen("\r\nGYO:\r\n"));
//		printff(USART3, TEST4,strlen(TEST4));   printff(USART3, "\t",strlen("\t"));
//		printff(USART3, TEST5,strlen(TEST5));   printff(USART3, "\t",strlen("\t"));
//		printff(USART3, TEST6,strlen(TEST6));   
//  	printff(USART3, "\r\nMAG:\r\n",strlen("\r\nMAG:\r\n"));
//		printff(USART3, TEST7,strlen(TEST7));   printff(USART3, "\t",strlen("\t"));
//		printff(USART3, TEST8,strlen(TEST8));   printff(USART3, "\t",strlen("\t"));
//		printff(USART3, TEST9,strlen(TEST9));   
//		printff(USART3, "\r\n",strlen("\r\n"));
//		printff(USART3, "\r\n",strlen("\r\n"));
//			
//		sprintf( Pitch_, "%f", getPitch() ); 
//		sprintf( Roll_, "%f", getRoll() ); 
//		sprintf( Yaw_, "%f", getYaw());
//		printff(USART3, "\r\n输出欧拉角:\r\n\r\n",strlen("\r\n输出欧拉角:\r\n\r\n"));
//		printff(USART3, "Pitch:\r\n",strlen("Pitch:\r\n"));
//		printff(USART3, Pitch_,strlen(Pitch_));
//		printff(USART3, "\r\n\r\nRoll:\r\n",strlen("\r\n\r\nRoll:\r\n"));
//		printff(USART3, Roll_,strlen(Roll_));
//		printff(USART3, "\r\n\r\nYaw:\r\n",strlen("\r\n\r\nYaw:\r\n"));
//		printff(USART3, Yaw_,strlen(Yaw_));
//		printff(USART3, "\r\n", strlen("\r\n"));
//		

//	printff(USART3, "-----------------------------------\r\n\r\n", strlen("-----------------------------------\r\n\r\n"));
//  LL_mDelay(50);
  }
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI|RCC_OSCILLATORTYPE_HSE|RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.MSICalibrationValue = 0;
  RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_11;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 1;
  RCC_OscInitStruct.PLL.PLLN = 12;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV7;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK | RCC_SYSCLKSOURCE_MSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_RTC|RCC_PERIPHCLK_USART1
                              |RCC_PERIPHCLK_USART2|RCC_PERIPHCLK_USART3
                              |RCC_PERIPHCLK_UART4|RCC_PERIPHCLK_USB
                              |RCC_PERIPHCLK_ADC;
  PeriphClkInit.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK2;
  PeriphClkInit.Usart2ClockSelection = RCC_USART2CLKSOURCE_PCLK1;
  PeriphClkInit.Usart3ClockSelection = RCC_USART3CLKSOURCE_PCLK1;
  PeriphClkInit.Uart4ClockSelection = RCC_UART4CLKSOURCE_PCLK1;
 // PeriphClkInit.AdcClockSelection = RCC_ADCCLKSOURCE_SYSCLK;
	PeriphClkInit.AdcClockSelection = RCC_ADCCLKSOURCE_PLLSAI1;
  PeriphClkInit.PLLSAI1.PLLSAI1Source = RCC_PLLSOURCE_HSE;
  PeriphClkInit.PLLSAI1.PLLSAI1M = 1;
  PeriphClkInit.PLLSAI1.PLLSAI1N = 12;
  PeriphClkInit.PLLSAI1.PLLSAI1P = RCC_PLLP_DIV7;
  PeriphClkInit.PLLSAI1.PLLSAI1Q = RCC_PLLQ_DIV2;
  PeriphClkInit.PLLSAI1.PLLSAI1R = RCC_PLLR_DIV2;
  PeriphClkInit.PLLSAI1.PLLSAI1ClockOut = RCC_PLLSAI1_ADC1CLK;
  PeriphClkInit.RTCClockSelection = RCC_RTCCLKSOURCE_LSI;
  PeriphClkInit.UsbClockSelection = RCC_USBCLKSOURCE_PLL;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the main internal regulator output voltage 
    */
  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
	
	//LL库系统时钟初始化
  LL_FLASH_SetLatency(LL_FLASH_LATENCY_2);

   if(LL_FLASH_GetLatency() != LL_FLASH_LATENCY_2)
  {
  Error_Handler();  
  }
  LL_PWR_SetRegulVoltageScaling(LL_PWR_REGU_VOLTAGE_SCALE1);

  LL_RCC_MSI_Enable();

   /* Wait till MSI is ready */
  while(LL_RCC_MSI_IsReady() != 1)
  {
    
